---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricNumber
source: html/bd48158d-7581-6d3c-5999-8987f73bf0f1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricNumber Property

"Fabric Number"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricNumber { get; }
```